Store/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Store/src/AccumulationRegisters/ТоварыНаСкладах/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает остатки номенклатуры по складам.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура, по которой необходимо получить остатки.
//  Склады - Массив - Массив складов, по которым необходимо получить 
Функция ОстаткиНоменклатуры(Номенклатура, Склады) Экспорт
	
	Результат = Новый Соответствие;
	
	Для Каждого Склад Из Склады Цикл
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Склад", Склад);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат.Вставить(Выборка.Склад, Выборка.Количество);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	

КонецФункции

Функция ПолучитьОстаткиПоСкладу(Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток * ТоварыНаСкладахОстатки.Цена КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Склад, Неопределено) КАК ТоварыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаЗначений;
	
КонецФункции


#КонецОбласти
